[![env0](https://app.env0.com/images/vcs-comment-banner.png)](https://env0.com)
🚀&nbsp; env0 had composed a PR Plan for environment [gcp-import / import-co-env0-2.32 ](https://app.env0.com/p/b469bcdd-486b-4eb7-80ca-81dae1f087bb/environments/73bfffff-ef91-427b-8ddd-8c7e0b7a469d):
```
Plan: 1 to add, 0 to change, 1 to destroy.
```
<details>
<summary>Plan Details</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
-   destroy

Terraform will perform the following actions:

  # google_storage_bucket.import-env0 will be destroyed
  # (because google_storage_bucket.import-env0 is not in configuration)
-   resource "google_storage_bucket" "import-env0" {
-       default_event_based_hold    = false -> null
-       effective_labels            = {} -> null
-       enable_object_retention     = false -> null
-       force_destroy               = false -> null
-       id                          = "bucket-not-made-using-terraform-env0" -> null
-       labels                      = {} -> null
-       location                    = "US" -> null
-       name                        = "bucket-not-made-using-terraform-env0" -> null
-       project                     = "content-gen-418510" -> null
-       project_number              = 583679955132 -> null
-       public_access_prevention    = "enforced" -> null
-       requester_pays              = false -> null
-       rpo                         = "DEFAULT" -> null
-       self_link                   = "https://www.googleapis.com/storage/v1/b/bucket-not-made-using-terraform-env0" -> null
-       storage_class               = "STANDARD" -> null
-       terraform_labels            = {} -> null
-       uniform_bucket_level_access = true -> null
-       url                         = "gs://bucket-not-made-using-terraform-env0" -> null

-       soft_delete_policy {
-           effective_time             = "2024-05-30T05:28:03.567Z" -> null
-           retention_duration_seconds = 604800 -> null
        }
    }

  # google_storage_bucket.import-env0-t will be created
+   resource "google_storage_bucket" "import-env0-t" {
+       effective_labels            = (known after apply)
+       force_destroy               = true
+       id                          = (known after apply)
+       location                    = "US"
+       name                        = "bucket-not-made-using-terraform-env0"
+       project                     = (known after apply)
+       project_number              = (known after apply)
+       public_access_prevention    = (known after apply)
+       rpo                         = (known after apply)
+       self_link                   = (known after apply)
+       storage_class               = "STANDARD"
+       terraform_labels            = (known after apply)
+       uniform_bucket_level_access = (known after apply)
+       url                         = (known after apply)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

```
</details>


```
Failed to calculate cost estimation
```


[Full PR Plan logs on env0](https://app.env0.com/p/b469bcdd-486b-4eb7-80ca-81dae1f087bb/environments/73bfffff-ef91-427b-8ddd-8c7e0b7a469d/deployments/296e4bbb-a1d7-4dbe-ac50-b239d7d74957)